1. Завантаження та огляд

Завантажте датасет Tips (Чайові) з файла у матеріалах tips.csv.

Виведіть (кожен пункт оцінюється в 0.5 бала):

Перші 5 рядків
Розмір датасету (shape)
Назви всіх колонок
Інформацію про типи даних (info)

In [1]:
import pandas as pd
from dask.dataframe.shuffle import sort_values
from rich.jupyter import display

In [5]:
# import Data
df = pd.read_csv('tips.csv')
# Show 5 first rows. We can use empty (), because it shows 5 rows by default, or we can type (5).
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
# data set size (shape)
display(df.shape)

(244, 7)

In [7]:
# columns names
display(df.columns)

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [8]:
# Info type
display(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

None

2. Базова вибірка даних
Виберіть та виведіть (кожен пункт оцінюється в 0.5 бала):
Колонку total_bill (загальний рахунок)
Колонки total_bill та tip (чайові) разом
Перші 10 рядків
Рядок з індексом 5

In [9]:
total_bill = df['total_bill']   # total_bill column
print(total_bill)

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [11]:
two_columns = df[['total_bill', 'tip']] # select 2 columns: 'total_bill' and 'tip'
display(two_columns)

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [12]:
# show 10 first rows
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [15]:
# index 5 row
print(df.iloc[5])

total_bill     25.29
tip             4.71
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
Name: 5, dtype: object

3. Фільтрація даних
Відфільтруйте повний набір даних та виведіть (кожен пункт оцінюється в 0.5 бала):

Всі рахунки більше 20 доларів (total_bill > 20)
Всі відвідувачі-жінки (sex == 'Female')
Рахунки на вечерю (time == 'Dinner')
Рахунки на вечерю з сумою чеку більше 30 доларів
Для виведення результатів фільтрації:

зберегти результат у окрему змінну
показати кількість записів у відфільтрованому наборі
вивести перші 5 записів відфільтрованого набору.

In [40]:
# total_bill > 20
bills_20 = df[df['total_bill'] > 20]
print(len(bills_20)) # total amount of bills > 20
display(bills_20.head()) # to show head() 5

97

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [119]:
# sex == female
female = df[df['sex'] == 'Female']
print(f'The total amount of female visitors is: ',len(female)) # total amount of female visitors
display(female.head()) # to show head() 5 female visitors

The total amount of female visitors is:  87

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

In [120]:
# dinner bills
dinner_bills = df[df['time']  == 'Dinner']
print(f'The total amount of dinner bills is: ', len(dinner_bills)) # dinner_bills total amount
display(dinner_bills.head()) # to show head() 5 dinner_bills

The total amount of dinner bills is:  176

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [123]:
# dinner_bill > 30
dinner_bill_30 = df[(df['time'] == 'Dinner') & (df['total_bill'] > 30)]
print(f'The total amount of dinner bills > $30 is: ', len(dinner_bill_30)) # total amount dinner bills > 30
display(dinner_bill_30.head()) # to show head() 5 dinner bills > 30

The total amount of dinner bills > $30 is:  27

    total_bill   tip     sex smoker  day    time  size
11       35.26  5.00  Female     No  Sun  Dinner     4
23       39.42  7.58    Male     No  Sat  Dinner     4
39       31.27  5.00    Male     No  Sat  Dinner     3
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4

4. Описова статистика
Обчисліть (кожен пункт оцінюється в 0.5 бала):
Середній розмір рахунку на всьому наборі даних
Максимальні чайові
Кількість пропущених значень у всіх колонках
Скільки в наборі даних рахунків за обіди і за вечері

In [124]:
# mean bill
mean_bill = df['total_bill'].mean()
print(f'Mean bill is $:', round(mean_bill)) # before round() the mean amount was 19.78594...

Mean bill is $: 20

In [125]:
# max tips
max_tips = df['tip'].max()
print(f'Max tips is $:', max_tips)

Max tips is $: 10.0

In [128]:
# Number of missing values in all columns
missing_values = df.isnull().sum()
print(missing_values)
print(f'THERE ARE NO MISSING VALUES')

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64
THERE ARE NO MISSING VALUES

In [64]:
# Lunch and dinner bills amount in dataset
lunch_and_dinner = df['time'].value_counts()
print(lunch_and_dinner)

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [68]:
# Mean bill by sex
mean_bill_by_sex = df.groupby('sex')['total_bill'].mean()
print(f'The mean bill by sex is:\n ', round(mean_bill_by_sex))

The mean bill by sex is:
  sex
Female    18.0
Male      21.0
Name: total_bill, dtype: float64

In [77]:
# Mean tip by day
mean_tip_by_day = df.groupby('day')['tip'].mean()
print(f'The mean tip by day is:\n ', mean_tip_by_day)
# In this case round() makes the same result for all days.
# Probably it's better to use a previous form to see the difference
print("------------------------") # visual divider
print(f'The mean tip by day is:\n ', round(mean_tip_by_day))

The mean tip by day is:
  day
Fri     2.734737
Sat     2.993103
Sun     3.255132
Thur    2.771452
Name: tip, dtype: float64
------------------------
The mean tip by day is:
  day
Fri     3.0
Sat     3.0
Sun     3.0
Thur    3.0
Name: tip, dtype: float64

In [76]:
# Daily visitors amount
daily_visits = df.groupby('day')['size'].sum()
print(f'The daily number of visits is:\n ', daily_visits)

The daily number of visits is:
  day
Fri      40
Sat     219
Sun     216
Thur    152
Name: size, dtype: int64

6. Створення нової колонки
Створіть нову колонку tip_percentage - відсоток чайових від загальної суми рахунку. Виведіть перші 10 рядків з новою колонкою.

In [132]:
tip_percentage = ((df['tip'] / df['total_bill']) * 100).round(2)
print("THE FIRST 10 TIP PERCENTAGES ARE: ")
print(round(tip_percentage.head(10)))

THE FIRST 10 TIP PERCENTAGES ARE:
0     6.0
1    16.0
2    17.0
3    14.0
4    15.0
5    19.0
6    23.0
7    12.0
8    13.0
9    22.0
dtype: float64

7. Сортування
Відсортуйте датасет і виведіть результат сортування в кожному випадку окремо (кожен пункт оцінюється в 0.5 бала):

За розміром рахунку (зростання)
За чайовими (спадання)
Додатково виведіть топ-5 найбільших чайових використовуючи метод nlargest.

In [108]:
# sorted by bill - increasing
sorted_by_bill =df.sort_values(['total_bill'], ascending=[True])
display(sorted_by_bill[['total_bill']].head(10))

     total_bill
67         3.07
92         5.75
111        7.25
172        7.25
149        7.51
195        7.56
218        7.74
145        8.35
135        8.51
126        8.52

In [118]:
# sorted by tips --- decreasing + top 5 tips
sorted_by_tips =df.sort_values(['tip'], ascending=[False])
top_tips = df.nlargest(5, ['tip'])
display(sorted_by_tips[['tip']].head(10), f'Top 5 tips:', top_tips[['tip']])

       tip
170  10.00
212   9.00
23    7.58
59    6.73
141   6.70
183   6.50
214   6.50
47    6.00
239   5.92
88    5.85

'Top 5 tips:'

       tip
170  10.00
212   9.00
23    7.58
59    6.73
141   6.70